package d49;

public class Q21 {
    static void main(String[] args) {
        //int n1 = 080;  // コンパイルエラー
        int n1 = 010;  // 010は10進数の8
        int n2 =0x10;  // 0x10は10進数の16

        System.out.println(n1 + n2);
    }
}

/*
10進数　2進数　 8進数  16進数
------------------------------
0      0      0     0
1      1      1     1
2      10     2     2
3      11     3     3
4      100    4     4
5      101    5     5
6      110    6     6
7      111    7     7
8      1000   10    8
9      1001   11    9
10     1010   12    a
11     1011   13    b
12     1100   14    c
13     1101   15    d
14     1110   16    e
15     1111   17    f
16     10000  20    10
17     10001  21    11
 */